""" 
    4. Написать функцию, которая принимает строку и
       возращает новую строку, в которой удалены все знаки пунктуации.
"""
PUNC = '!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~'


def clear_punc(s):
    # Ваш код
    pass


print(clear_punc("-Test,Line1! Works';. Right?-Да:"))
# Out: TestLine1 Works RightДа